alterando nome de pastas, criando testes e modificando controllers
